In [11]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv('investments - investments.csv')

In [15]:
df.columns

Index(['name', 'homepage_url', 'category_list', 'market', 'funding_total_usd',
       'status', 'country_code', 'state_code', 'region', 'city',
       'funding_rounds', 'founded_year', 'debt_financing', 'grant'],
      dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49438 entries, 0 to 49437
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               49437 non-null  object
 1   homepage_url       45989 non-null  object
 2   category_list      45477 non-null  object
 3   market             45470 non-null  object
 4   funding_total_usd  49438 non-null  object
 5   status             48124 non-null  object
 6   country_code       44165 non-null  object
 7   state_code         30161 non-null  object
 8   region             44165 non-null  object
 9   city               43322 non-null  object
 10  funding_rounds     49438 non-null  int64
 11  founded_year       38482 non-null  float64
 12  debt_financing     49438 non-null  int64
 13  grant              49438 non-null  int64
dtypes: float64(1), int64(3), object(10)
memory usage: 5.3+ MB

In [12]:
df.select_dtypes(include=[np.number])

       funding_rounds  founded_year  debt_financing  grant
0                   1        2012.0               0      0
1                   2           NaN               0      0
2                   1        2012.0               0      0
3                   1        2011.0               0      0
4                   2        2014.0               0      0
...               ...           ...             ...    ...
49433               1        2013.0               0      0
49434               1           NaN               0      0
49435               5        2012.0               0      0
49436               1           NaN               0      0
49437               4        1999.0        17000000      0

[49438 rows x 4 columns]

In [13]:
df.select_dtypes(include=[object])

,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city
0,#waywire,http://www.waywire.com,|Entertainment|Politics|Social Media|News|,News,"17,50,000",acquired,USA,NY,New York City,New York
1,&TV Communications,http://enjoyandtv.com,|Games|,Games,"40,00,000",operating,USA,CA,Los Angeles,Los Angeles
2,Rock' Your Paper,http://www.rockyourpaper.org,|Publishing|Education|,Publishing,"40,000",operating,EST,NaN,Tallinn,Tallinn
3,(In)Touch Network,http://www.InTouchNetwork.com,|Electronics|Guides|Coffee|Restaurants|Music|i...,Electronics,"15,00,000",operating,GBR,NaN,London,London
4,-R- Ranch and Mine,NaN,|Tourism|Entertainment|Games|,Tourism,"60,000",operating,USA,TX,Dallas,Fort Worth
...,...,...,...,...,...,...,...,...,...,...
49433,Zzish,http://www.zzish.com,|Analytics|Gamification|Developer APIs|iOS|And...,Education,"3,20,000",operating,GBR,NaN,London,London
49434,ZZNode Science and Technology,http://www.zznode.com,|Enterprise Software|,Enterprise Software,"15,87,301",operating,CHN,NaN,Beijing,Beijing
49435,Zzzzapp Wireless ltd.,http://www.zzzzapp.com,|Web Development|Advertising|Wireless|Mobile|,Web Development,"97,398",operating,HRV,NaN,Split,Split
49436,[a]list games,http://www.alistgames.com,|Games|,Games,"93,00,000",operating,NaN,NaN,NaN,NaN
49437,[x+1],http://www.xplusone.com/,|Enterprise Software|,Enterprise Software,"4,50,00,000",operating,USA,NY,New York City,New York

In [18]:
df.describe()

       funding_rounds  founded_year  debt_financing         grant
count    49438.000000  38482.000000    4.943800e+04  4.943800e+04
mean         1.696205   2007.359129    1.888157e+06  1.628453e+05
std          1.294213      7.579203    1.382046e+08  5.612088e+06
min          1.000000   1902.000000    0.000000e+00  0.000000e+00
25%          1.000000   2006.000000    0.000000e+00  0.000000e+00
50%          1.000000   2010.000000    0.000000e+00  0.000000e+00
75%          2.000000   2012.000000    0.000000e+00  0.000000e+00
max         18.000000   2014.000000    3.007950e+10  7.505000e+08

In [20]:
df.duplicated().sum()

0

In [24]:
df.duplicated(['name', 'homepage_url', 'category_list'])

0        False
1        False
2        False
3        False
4        False
         ...
49433    False
49434    False
49435    False
49436    False
49437    False
Length: 49438, dtype: bool

In [ ]:
# remove duplicate

In [29]:
df.isnull().sum()/df.shape[0]

name                 0.000020
homepage_url         0.069764
category_list        0.080121
market               0.080262
funding_total_usd    0.000000
status               0.026579
country_code         0.106659
state_code           0.389923
region               0.106659
city                 0.123711
funding_rounds       0.000000
founded_year         0.221611
debt_financing       0.000000
grant                0.000000
dtype: float64

In [33]:
df.groupby('country_code')['name'].count().reset_index().sort_values()  #reset index converts as dataframe

TypeError: sort_values() missing 1 required positional argument: 'by'

In [35]:
df.groupby('status')['name'].count()

status
acquired      3692
closed        2602
operating    41829
Name: name, dtype: int64

In [39]:
df.founded_year.isna().count()

49438